belohoub/stm32flash/main.c
			case 'k':
				if (action != ACT_NONE) {
					err_multi_action(ACT_READ_UNPROTECT);
					return 1;
				}
				action = ACT_READ_UNPROTECT;
				break;

			case 'o':
				if (action != ACT_NONE) {
					err_multi_action(ACT_ERASE_ONLY);
					return 1;
				}
				action = ACT_ERASE_ONLY;
				break;

			case 'v':
				verify = 1;
				break;

			case 'n':
				retry = strtoul(optarg, NULL, 0);
				break;

			case 'g':
				exec_flag = 1;
				execute   = strtoul(optarg, NULL, 0);
				if (execute % 4 != 0) {
					fprintf(stderr, "ERROR: Execution address must be word-aligned\n");
					return 1;
				}
				break;
			case 's':
				if (readwrite_len || start_addr) {
					fprintf(stderr, "ERROR: Invalid options, can't specify start page / num pages and start address/length\n");
					return 1;
				}
				spage    = strtoul(optarg, NULL, 0);
				break;
			case 'S':
				if (spage || npages) {
					fprintf(stderr, "ERROR: Invalid options, can't specify start page / num pages and start address/length\n");
					return 1;
				} else {
					start_addr = strtoul(optarg, &pLen, 0);
					if (start_addr % 4 != 0) {
						fprintf(stderr, "ERROR: Start address must be word-aligned\n");
						return 1;
					}
					/* we decode 0 as 1 (which is unaligned and thus invalid anyway)
					 * to flag that it was set by the user */
					if (pLen != optarg && start_addr == 0)
						start_addr = 1;
					if (*pLen == ':') {
						pLen++;
						readwrite_len = strtoul(pLen, NULL, 0);
						if (readwrite_len == 0) {
							fprintf(stderr, "ERROR: Invalid options, can't specify zero length\n");
							return 1;
						}
					}
				}
				break;
			case 'F':
				port_opts.rx_frame_max = strtoul(optarg, &pLen, 0);
				if (*pLen == ':') {
					pLen++;
					port_opts.tx_frame_max = strtoul(pLen, NULL, 0);
				}
				if (port_opts.rx_frame_max < 0
				    || port_opts.tx_frame_max < 0) {
					fprintf(stderr, "ERROR: Invalid negative value for option -F\n");
					return 1;
				}
				if (port_opts.rx_frame_max == 0)
					port_opts.rx_frame_max = STM32_MAX_RX_FRAME;
				if (port_opts.tx_frame_max == 0)
					port_opts.tx_frame_max = STM32_MAX_TX_FRAME;
				if (port_opts.rx_frame_max < 20
				    || port_opts.tx_frame_max < 6) {
					fprintf(stderr, "ERROR: current code cannot work with small frames.\n");
					fprintf(stderr, "min(RX) = 20, min(TX) = 6\n");
					return 1;
				}
				if (port_opts.rx_frame_max > STM32_MAX_RX_FRAME) {
					fprintf(stderr, "WARNING: Ignore RX length in option -F\n");
					port_opts.rx_frame_max = STM32_MAX_RX_FRAME;
				}
				if (port_opts.tx_frame_max > STM32_MAX_TX_FRAME) {
					fprintf(stderr, "WARNING: Ignore TX length in option -F\n");
					port_opts.tx_frame_max = STM32_MAX_TX_FRAME;
				}
				break;
			case 'f':
				force_binary = 1;
				break;

			case 'c':
				init_flag = 0;
				break;

			case 'h':
				show_help(argv[0]);
				exit(0);

			case 'i':
				gpio_seq = optarg;
				break;

			case 'R':
				reset_flag = 1;
				break;

			case 'C':
				if (action != ACT_NONE) {
					err_multi_action(ACT_CRC);
					return 1;
				}
				action = ACT_CRC;
				break;
            case 'x':
				if (action != ACT_NONE) {
					err_multi_action(ACT_SPECIAL_CMD);
					return 1;
				}
				action = ACT_SPECIAL_CMD;
				
				cmd_opcode = strtoul(optarg, &pLen, 16);
				if (*pLen == ':') {
					cmd_param = (pLen+1);
				}
				break;
				
            case 't':
				timeout = strtoul(optarg, NULL, 0);
				break;

            case 'X':
				if (action != ACT_NONE) {
					err_multi_action(ACT_EXT_SPECIAL_CMD);
					return 1;
				}
				action = ACT_EXT_SPECIAL_CMD;
				
				fprintf(stderr, "ERROR: eXtended special command not implemented yet!\n");
				return 1;
                break;
		}
	}

	for (c = optind; c < argc; ++c) {
		if (port_opts.device) {
			fprintf(stderr, "ERROR: Invalid parameter specified\n");
			show_help(argv[0]);
			return 1;
		}
		port_opts.device = argv[c];
	}

	if (port_opts.device == NULL) {
		fprintf(stderr, "ERROR: Device not specified\n");
		show_help(argv[0]);
		return 1;
	}

	if ((action != ACT_WRITE) && verify) {
		fprintf(stderr, "ERROR: Invalid usage, -v is only valid when writing\n");
		show_help(argv[0]);
		return 1;
	}

	return 0;
}

void show_help(char *name) {
	fprintf(stderr,
		"Usage: %s [-bvngfhc] [-[rw] filename] [tty_device | i2c_device]\n"
		"	-a bus_address	Bus address (e.g. for I2C port)\n"
		"	-b rate		Baud rate (default 57600)\n"
		"	-m mode		Serial port mode (default 8e1)\n"
		"	-r filename	Read flash to file (or - stdout)\n"
		"	-w filename	Write flash from file (or - stdout)\n"
		"	-C		Compute CRC of flash content\n"
		"	-u		Disable the flash write-protection\n"
		"	-j		Enable the flash read-protection\n"
		"	-k		Disable the flash read-protection\n"
		"	-o		Erase only\n"
		"	-e n		Only erase n pages before writing the flash\n"
		"	-v		Verify writes\n"
		"	-n count	Retry failed writes up to count times (default 10)\n"
		"	-g address	Start execution at specified address (0 = flash start)\n"
		"	-S address[:length]	Specify start address and optionally length for\n"
		"	                   	read/write/erase operations\n"
		"	-F RX_length[:TX_length]  Specify the max length of RX and TX frame\n"
		"	-s start_page	Flash at specified page (0 = flash start)\n"
		"	-f		Force binary parser\n"
		"	-h		Show this help\n"
		"	-c		Resume the connection (don't send initial INIT)\n"
		"			*Baud rate must be kept the same as the first init*\n"
		"			This is useful if the reset fails\n"
		"	-R		Reset device at exit.\n"
		"	-i GPIO_string	GPIO sequence to enter/exit bootloader mode\n"
		"			GPIO_string=[entry_seq][:[exit_seq]]\n"
		"			sequence=[[-]signal]&|,[sequence]\n"
        "	-t timeout	Timeout in seconds (default 5s; currently applies on special command only)\n"
        "	-x CMD_string	hex-encoded special command \n"
		"			CMD_string=cmd_opcode[:cmd_param]\n"
        "	-X CMD_string	hex-encoded eXtended special command (RFU - not implemented yet)\n"
		"			CMD_string=cmd_opcode[:cmd_param[:cmd_extpar]]\n"
		"\n"
		"GPIO sequence:\n"
		"	The following signals can appear in a sequence:\n"
		"	  Integer number representing GPIO pin\n"
		"	  'dtr', 'rts' or 'brk' representing serial port signal\n"
		"	The sequence can use the following delimiters:\n"
		"	  ',' adds 100 ms delay between signals\n"
		"	  '&' adds no delay between signals\n"
		"	The following modifiers can be prepended to a signal:\n"
		"	  '-' reset signal (low) instead of setting it (high)\n"
		"\n"
		"Special command:\n"
		"	cmd_opcode:   defines the sub-command op-code (2 bytes, MSB-first)\n"
		"	cmd_param:   defines the custom command parameters (up to 128 bytes, application-speciffic)\n"
		"	cmd_extpar:   !!!Not implemented yet!!! defines the custom command extended parameters (up to 1024 bytes, application-speciffic)\n"
		"	cmd_param and cmd_extpar can also be read from stdin; if you wish to read binary from stdin (e.g. unix pipe |), use  \'&length\' syntax in place of cmd_param or cmd_extpar respectively '&length' represents the parameter length in bytes"
        "\n"
		"Examples:\n"
		"	Get device information:\n"
		"		%s /dev/ttyS0\n"
		"	  or:\n"
		"		%s /dev/i2c-0\n"
		"\n"
		"	Write with verify and then start execution:\n"
		"		%s -w filename -v -g 0x0 /dev/ttyS0\n"
		"\n"
		"	Read flash to file:\n"
		"		%s -r filename /dev/ttyS0\n"
		"\n"
		"	Read 100 bytes of flash from 0x1000 to stdout:\n"
		"		%s -r - -S 0x1000:100 /dev/ttyS0\n"
		"\n"
		"	Start execution:\n"
		"		%s -g 0x0 /dev/ttyS0\n"
		"\n"
		"	GPIO sequence:\n"
		"	- entry sequence: GPIO_3=low, GPIO_2=low, 100ms delay, GPIO_2=high\n"
		"	- exit sequence: GPIO_3=high, GPIO_2=low, 300ms delay, GPIO_2=high\n"
		"		%s -i '-3&-2,2:3&-2,,,2' /dev/ttyS0\n"
		"	GPIO sequence adding delay after port opening:\n"
		"	- entry sequence: delay 500ms\n"
		"	- exit sequence: rts=high, dtr=low, 300ms delay, GPIO_2=high\n"
		"		%s -R -i ',,,,,:rts&-dtr,,,2' /dev/ttyS0\n"
		"\n"
		"	Execute special \'Hello World\' command (inline parameter):\n"
		"		%s -x 0000:4F4B21 -t 32 /dev/ttyS0\n"
		"	Execute special \'Hello World\' command (pipe-passed binary parameter):\n"
		"		echo -n -e '\\x4f\\x4b\\x21' | %s -x 0000:&3 /dev/ttyS0\n",
		name,
		name,
		name,
		name,
		name,
		name,
		name,
		name,
		name,
		name,
		name
	);
}

